[
  {
    "id": "boston-marathon",
    "name": "Boston Marathon",
    "location": "Boston, Massachusetts, USA",
    "date": "2025-04-21",
    "distance": "42.195 km",
    "website": "https://www.baa.org/races/boston-marathon",
    "description": "The world's oldest annual marathon, held every year since 1897. Known for its challenging course featuring the notorious Heartbreak Hill and prestigious qualifying standards. The race starts in Hopkinton and finishes on Boylston Street in downtown Boston. As one of the six World Marathon Majors, it attracts elite runners from around the globe. Runners must meet strict qualifying times based on age and gender to participate in this historic event."
  },
  {
    "id": "london-marathon",
    "name": "London Marathon",
    "location": "London, England, UK",
    "date": "2025-04-27",
    "distance": "42.195 km",
    "website": "https://www.londonmarathon.com/",
    "description": "One of the World Marathon Majors, featuring a flat and fast course through the heart of London. The route passes iconic landmarks including Tower Bridge, the London Eye, Big Ben, and Buckingham Palace. Founded in 1981, it has grown to become one of the largest annual fundraising events in the world, raising hundreds of millions for charity. The course is renowned for its enthusiastic crowds and is considered one of the best races for achieving personal best times."
  },
  {
    "id": "tokyo-marathon",
    "name": "Tokyo Marathon",
    "location": "Tokyo, Japan",
    "date": "2025-03-02",
    "distance": "42.195 km",
    "website": "https://www.marathon.tokyo/en/",
    "description": "A World Marathon Major that showcases Tokyo's vibrant cityscape and culture. The course winds through the city's diverse neighborhoods, passing landmarks like the Tokyo Metropolitan Government Building, Imperial Palace, and Tokyo Tower. First held in 2007, it quickly became one of the most sought-after marathons globally. Known for exceptional organization, enthusiastic volunteers, and the unique experience of running through one of the world's most dynamic cities. The race blends modern urban energy with traditional Japanese hospitality."
  }
]
